PER_PAGE = 10 # default pagination size

# 150 japanese characters 
HIRAGANA            = ['あ', 'い', 'う', 'え', 'お',   'か', 'き', 'く', 'け', 'こ',   'さ', 'し', 'す', 'せ', 'そ',   'た', 'ち', 'つ', 'て', 'と',   'な', 'に', 'ぬ', 'ね', 'の',   'は', 'ひ', 'ふ', 'へ', 'ほ',   'ま', 'み', 'む', 'め', 'も',   'や', '', 'ゆ', '', 'よ',   'ら', 'り',  'る', 'れ', 'ろ',   'わ', '',    '', '', 'を'   ]
HIRAGANA_DAKUTEN    = [''  , '' , ''  , ''  , '' ,   'が', 'ぎ', 'ぐ', 'げ', 'ご',   'ざ', 'じ', 'ず', 'ぜ', 'ぞ',   'だ', 'ぢ', 'づ', 'で', 'ど',     '',   '',  '',   '',  '',    'ば', 'び', 'ぶ', 'べ', 'ぼ',    '',  '',   '',   '',   '',     '', '',  '', '',   '',   '',    '',    '',   '',  '',    '',   '',  '',   '', ''    ]
HIRAGANA_HANDAKUTEN = [''  , '' , ''  , ''  , '' ,     '',  '',   '',   '',  '',     '',   '',  '',   '',   '',    '',   '',  '',   '',   '',     '',  '',   '',   '',  '',    'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ',    '',   '',  '',   '',   '',     '', '',  '', '',   '',   '',    '',    '',   '',  '',    '',   '',  '',   '', ''    ]

KATAKANA            = ['ア', 'イ', 'ウ', 'エ', 'オ',   'カ', 'キ', 'ク', 'ケ', 'コ',   'サ', 'シ', 'ス', 'セ', 'ソ',   'タ', 'チ', 'ツ', 'テ', 'ト',   'ナ', 'ニ', 'ヌ', 'ネ', 'ノ',   'ハ', 'ヒ', 'フ', 'ヘ', 'ホ',   'マ', 'ミ', 'ム', 'メ', 'モ',   'ヤ', '', 'ユ', '', 'ヨ',   'ラ', 'リ',  'ル', 'レ', 'ロ',   'ワ', 'ヰ',  '', 'ヱ', 'ヲ' ]
KATAKANA_DAKUTEN    = [''  , '' , ''  , ''  , '' ,   'ガ', 'ギ', 'グ', 'ゲ', 'ゴ',   'ザ', 'ジ ', 'ズ', 'ゼ', 'ゾ',   'ダ', 'ヂ', 'ヅ', 'デ', 'ド',     '',   '',  '',   '',  '',   'バ', 'ビ', 'ブ', 'ベ', 'ボ',    '',  '',   '',   '',   '',     '', '',  '', '',   '',   '',    '',    '',   '',  '',    '',   '',  '',   '', ''    ]
KATAKANA_HANDAKUTEN = [''  , '' , ''  , ''  , '' ,     '',  '',   '',   '',  '',     '',   '',  '',   '',   '',    '',   '',  '',   '',   '',     '',  '',   '',   '',  '',    'パ', 'ピ', 'プ', 'ペ', 'ポ',    '',   '',  '',   '',   '',     '', '',  '', '',   '',   '',    '',    '',   '',  '',    '',   '',  '',   '', ''    ]

# '*' + all latin letters + ukrainian cyrillic + japanese hiragana
BY_LETTER = "*A-ZА-Я#{HIRAGANA.join}"
# '*' + all latin letters + ukrainian cyrillic + japanese hiragana and katakana and dakuten and handakuten for both
LETTERS = "*A-ZА-Я#{(HIRAGANA + KATAKANA + HIRAGANA_DAKUTEN + HIRAGANA_HANDAKUTEN + KATAKANA_DAKUTEN + KATAKANA_HANDAKUTEN).join}"
